---
title: MechanicalEquipmentSetType
classe: Autodesk.Revit.DB.Mechanical.MechanicalEquipmentSetType
namespace: Autodesk.Revit.DB.Mechanical
eredita: Autodesk.Revit.DB.ElementType
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 1
---

# MechanicalEquipmentSetType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `MechanicalEquipmentSetType Create(Document, String)` | `MechanicalEquipmentSetType.Create(document, name)` | MechanicalEquipmentSetType |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```